In [19]:
import pandas as pd

data = pd.read_csv('고혈압_당뇨.csv')
data.head()

   SEX  BTH_G  SBP  DBP  FBS  DIS   BMI
0    1      1  116   78   94    4  16.6
1    1      1  100   60   79    4  22.3
2    1      1  100   60   87    4  21.9
3    1      1  111   70   72    4  20.2
4    1      1  120   80   98    4  20.0

In [20]:
# 데이터 타입, 결측치 확인

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 7 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   SEX     1000000 non-null  int64
 1   BTH_G   1000000 non-null  int64
 2   SBP     1000000 non-null  int64
 3   DBP     1000000 non-null  int64
 4   FBS     1000000 non-null  int64
 5   DIS     1000000 non-null  int64
 6   BMI     1000000 non-null  float64
dtypes: float64(1), int64(6)
memory usage: 53.4 MB

In [21]:
# 컬럼별 결측치 확인2

data.isnull().sum()

SEX      0
BTH_G    0
SBP      0
DBP      0
FBS      0
DIS      0
BMI      0
dtype: int64

In [22]:
# 데이터의 전체 결측치 개수

data.isnull().sum().sum()

0

In [23]:
# 컬럼명 변경

data.columns = ['sex','age', 'sbp', 'dbp', 'fbs', 'dis', 'bmi']
data.head()

   sex  age  sbp  dbp  fbs  dis   bmi
0    1    1  116   78   94    4  16.6
1    1    1  100   60   79    4  22.3
2    1    1  100   60   87    4  21.9
3    1    1  111   70   72    4  20.2
4    1    1  120   80   98    4  20.0

## 1. 맥압 추가

In [24]:
data['ppr'] = data['sbp'] - data['dbp']
data.head()

   sex  age  sbp  dbp  fbs  dis   bmi  ppr
0    1    1  116   78   94    4  16.6   38
1    1    1  100   60   79    4  22.3   40
2    1    1  100   60   87    4  21.9   40
3    1    1  111   70   72    4  20.2   41
4    1    1  120   80   98    4  20.0   40

### 2. 고혈압, 당뇨 추가
dis
```
1 : 고혈압 & 당뇨 o
2 : 고혈압 o
3 : 당뇨 o 
4 : 고혈압 & 당뇨 x
```
- htn : 고혈압 (1 : o, 0 : x)
- dm : 당뇨 (1 : o, 0 : x)

In [25]:
data['dis'].value_counts()

4    740662
2    162826
1     53398
3     43114
Name: dis, dtype: int64

##### 1) 고혈압(htn) 컬럼 추가

In [28]:
map1 = {1:1, 2:1, 3:0, 4:0}
htn = data['dis'].map(map1)

df_htn = pd.DataFrame(htn)
df_htn.columns = ['htn']
data1 = data.join(df_htn)
data1.head()

   sex  age  sbp  dbp  fbs  dis   bmi  ppr  htn
0    1    1  116   78   94    4  16.6   38    0
1    1    1  100   60   79    4  22.3   40    0
2    1    1  100   60   87    4  21.9   40    0
3    1    1  111   70   72    4  20.2   41    0
4    1    1  120   80   98    4  20.0   40    0

In [29]:
data1['htn'].value_counts()

0    783776
1    216224
Name: htn, dtype: int64

##### 2) 당뇨(dm) 컬럼 추가

In [30]:
map2 = {1:1, 2:0, 3:1, 4:0}
dm = data['dis'].map(map2)

df_dm = pd.DataFrame(dm)
df_dm.columns = ['dm']
data2 = data1.join(df_dm)
data2.head()

   sex  age  sbp  dbp  fbs  dis   bmi  ppr  htn  dm
0    1    1  116   78   94    4  16.6   38    0   0
1    1    1  100   60   79    4  22.3   40    0   0
2    1    1  100   60   87    4  21.9   40    0   0
3    1    1  111   70   72    4  20.2   41    0   0
4    1    1  120   80   98    4  20.0   40    0   0

In [31]:
data2['dm'].value_counts()

0    903488
1     96512
Name: dm, dtype: int64

In [33]:
data2.to_csv('htn_dm.csv', index = False)